package Events;

import Hero.Hero;

public class ThirdEvent {
    Hero hero;

    public ThirdEvent(Hero hero) {
        this.hero = hero;
    }

    public void history(){
        System.out.println("Все идет по линейке! Нужно было идти за этим гребаным клубком и всего этого не было бы!");
        System.out.println("Никаких жертв мои глаза не видели бы! К чёрту все!");
        System.out.println("***");
        System.out.println("(Голос из головы):");
        System.out.println("-" + hero.getHeroName() + ", я дал тебе возможность найти ответы на твои вопросы, но ты не воспользовался ей!");
        System.out.println("Я вижу, что ты не отступил и идешь дальше!");
        System.out.println("К счастью, ты совсем рядом с тем местом, куда я тебя хотел привести.");
        System.out.println("За кудыкины горы, воровать помидоры, эгэээй!");
        System.out.println("Вот, возьми этот компас, и следуй строго на юго-запад и набредешь на это место.");
        System.out.println("Надеюсь, с этой штукой обращаться умеешь?");
        System.out.println("Вперёд!");
        System.out.println("***");
        System.out.println("Следуя строго по направлению, ты изнемогая, почти пришел к месту.");
        System.out.println("Но не тут то было! Ты слышишь странный шелест, не похожий на шелест деревьев.");
        System.out.println("Что это? Обстановка накаляется к каждой 0.0001 милесекундой, сердце стучит, словно голодный дятел по дереву!");
        System.out.println("ХА! Это черепашка, которая явно потерялась, надо взять ее с собой, вдруг еще пригодится!");
        System.out.println("***ожидание***");
        System.out.println("***ожидание***");
        System.out.println("Вот мы и набрели на избушку.");
        System.out.println("-Неловко заходить без приглашения! Пускай-ка Мартин(черепашка, которую мы нашли) заползёт первый!");
        System.out.println("Пустив черепашку в щель приоткрытой двери, мы понимаем что внутри никого нет и можно спокойно заходить!");
        System.out.println("Дома мы видим множетсво карт на стенах, запасы еды, которые мы обязательно берем с собой.");
        System.out.println("*хрясть!*");
        System.out.println("Дверь резко закрылась, перед глазами встал неисотвый робот, похожий на того робота, которым ты воспитывался в детстве в инкубаторе!");
        System.out.println("Я BB-8, проект отряда Star Wars. Цель вашего визита?");
        System.out.println("");
    }
}
